{
  "nodes": [
    {
      "op": "null", 
      "name": "inputs", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "733356b0a193f0ba"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW1c", 
        "dst_layout": "NCHW", 
        "hash": "ec6f1e3d8e3d90ed", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "cd2298cdfea0f565"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6a80c5f158a90b76", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "26ac8d8f229bdbc2", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6a80c5f158a90b76", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "26ac8d8f229bdbc2", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6a80c5f158a90b76", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "26ac8d8f229bdbc2", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "58500b4f84a5a802", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "ddfdcffc11c046d9", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "516d7e56af931306", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e69b8bbabdd43b20", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "516d7e56af931306", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e69b8bbabdd43b20", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "516d7e56af931306", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e69b8bbabdd43b20", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "516d7e56af931306", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "7113d26dd9178764", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "063f1969d119a16f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "aa18dcc9a46d3044", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ], 
        [
          106, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "aa18dcc9a46d3044", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "aa18dcc9a46d3044", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          117, 
          0, 
          0
        ], 
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ], 
        [
          124, 
          0, 
          0
        ], 
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "aa18dcc9a46d3044", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ], 
        [
          136, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p108", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p109", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p110", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p111", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "aa18dcc9a46d3044", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ], 
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ], 
        [
          141, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p112", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p113", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p114", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p115", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "06184952376a58b6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          142, 
          0, 
          0
        ], 
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ], 
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p116", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p117", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p118", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p119", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "7095d3dd6179ce4f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          147, 
          0, 
          0
        ], 
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ], 
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          152, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p120", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p121", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p122", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p123", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p124", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p125", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p126", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p127", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__5f20761b26e59dc6__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "5020751b8cdb5e54", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          147, 
          0, 
          0
        ], 
        [
          158, 
          0, 
          0
        ], 
        [
          159, 
          0, 
          0
        ], 
        [
          160, 
          0, 
          0
        ], 
        [
          161, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "3a5078229c1047d0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ], 
        [
          156, 
          0, 
          0
        ], 
        [
          157, 
          0, 
          0
        ], 
        [
          162, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          163, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p128", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p129", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p130", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p131", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "547ed1f342a26a87", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          164, 
          0, 
          0
        ], 
        [
          165, 
          0, 
          0
        ], 
        [
          166, 
          0, 
          0
        ], 
        [
          167, 
          0, 
          0
        ], 
        [
          168, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          169, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p132", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p133", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p134", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p135", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "3a5078229c1047d0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          170, 
          0, 
          0
        ], 
        [
          171, 
          0, 
          0
        ], 
        [
          172, 
          0, 
          0
        ], 
        [
          173, 
          0, 
          0
        ], 
        [
          174, 
          0, 
          0
        ], 
        [
          164, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          175, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p136", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p137", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p138", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p139", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__7_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__75a28e1f421d188a__7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "547ed1f342a26a87", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          176, 
          0, 
          0
        ], 
        [
          177, 
          0, 
          0
        ], 
        [
          178, 
          0, 
          0
        ], 
        [
          179, 
          0, 
          0
        ], 
        [
          180, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          181, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p140", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p141", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p142", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p143", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "6", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_squeeze_expand_dims_multiply_layout_transform_nn_contrib__d01702d9cc2af40b__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "3a5078229c1047d0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          182, 
          0, 
          0
        ], 
        [
          183, 
          0, 
          0
        ], 
        [
          184, 
          0, 
          0
        ], 
        [
          185, 
          0, 
          0
        ], 
        [
          186, 
          0, 
          0
        ], 
        [
          176, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "7725c41ab86b808c"
      }, 
      "inputs": [
        [
          187, 
          0, 
          0
        ]
      ]
    }, 
    {
