{
  "nodes": [
    {
      "op": "null", 
      "name": "inputs", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "733356b0a193f0ba"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW1i4o", 
        "data_layout": "NCHW1c", 
        "dst_layout": "NCHW", 
        "hash": "151e7f1fca98b86f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "cd2298cdfea0f565"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "627aeb87a8799ed0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "132824b2f5d6fc8b", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "627aeb87a8799ed0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "132824b2f5d6fc8b", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "627aeb87a8799ed0", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "132824b2f5d6fc8b", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "8dbba8c9e904ae21", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "bc234c27db8f4556", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "73fad504ea8a9e34", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "cba869fd6284a62c", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "73fad504ea8a9e34", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "cba869fd6284a62c", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "73fad504ea8a9e34", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "cba869fd6284a62c", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "73fad504ea8a9e34", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "705e33a0ad54dfe6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "343121d482744e40", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2ca7b5f4f834b10f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2ca7b5f4f834b10f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2ca7b5f4f834b10f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2ca7b5f4f834b10f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "2ca7b5f4f834b10f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a1f31150583b2416", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          114, 
          0, 
          0
        ], 
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "d5b612fb46c4175c", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          122, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_460fba6d2ccd9037__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e3373eec7f307bee", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6115f828725ae21f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          123, 
          0, 
          0
        ], 
        [
          124, 
          0, 
          0
        ], 
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ], 
        [
          130, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "63f009be3ca8ba83", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ], 
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6115f828725ae21f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ], 
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ], 
        [
          132, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          141, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__7_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_54bd08102bea6f05__7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "63f009be3ca8ba83", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          142, 
          0, 
          0
        ], 
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ], 
        [
          145, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "e353272981fedee4"
      }, 
      "inputs": [
        [
          146, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "5", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_e93503fa0c65f6d7__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "6115f828725ae21f", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          147, 
          0, 
          0
        ], 
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "7725c41ab86b808c"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "__nop", 
        "hash": "1f2d8cb310c94a5b"
      }, 
      "inputs": [
        [
          152, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p108", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p109", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_nn_contrib_dense_pack_expand_dims_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_nn_contrib_dense_pack_expand_dims_add", 
        "src_layout": "NC", 
        "dst_layout": "NC5n", 
        "hash": "9c7601fbca5f8a31", 
        "weight_layout": "NC5n"
      }, 
      "inputs": [
        [
          153, 
          0, 
          0
        ], 
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_softmax", 
        "hash": "1fbe105a953bf8a8"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    7, 
    8, 
    9, 
    11, 
    12, 
    13, 
    15, 
    16, 
    17, 
    19, 
    20, 
    21, 
    23, 
    24, 
    25, 
    27, 
    28, 
    29, 
    31, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    43, 
    44, 
    45, 
    47, 
    48, 
    49, 
    51, 
    52, 
    53, 
    55, 
    56, 
    57, 
    59, 
    60, 
    61, 
    63, 
    64, 
    65, 
    67, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    83, 
    84, 
    85, 
    87, 
    88, 
    89, 
    91, 
    92, 
    93, 
    95, 
    96, 
    97, 
    99, 
    100, 
    101, 
    103, 
    104, 
    105, 
    107, 
    108, 
    109, 
    111, 
    112, 
    113, 
    115, 
    116, 
    117, 
    119, 
    120, 
    121, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    133, 
    134, 
    135, 
    138, 
    139, 
    140, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    154, 
    155
  ], 
  "heads": [
    [
      157, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
