{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW3i4o", 
        "data_layout": "NCHW3c", 
        "dst_layout": "NCHW", 
        "hash": "e4db9a119bff2ad3", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "e08364b16dcba64d"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "b4452538688cc761", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a46ff5ae8ead2d6a", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "b4452538688cc761", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a46ff5ae8ead2d6a", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e2316141e00b4b74", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156_", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "18f0e8062760c12e", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e761a423ba737c7d", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "4260dfba57502fda", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "e761a423ba737c7d", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__4", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a87e7dcdcddc9a74", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156__1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156__1", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "d24cbafd9ce2648c", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "c6e03c1a65f1191b", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__5", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a9593987cc9c45eb", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "c6e03c1a65f1191b", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__6", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "a4c8eafd79a9acbc", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156__2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_8688406651691020156__2", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "258a0eea2878e4c6", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "63f009be3ca8ba83", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_5646139030099741323__7", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "adc1eb3415d0ab05", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_layout_transform_nn_contrib_conv2d_NCHWc_expand_dims_expa_6106045535333543685__3", 
        "out_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "data_layout": "NCHW4c", 
        "dst_layout": "NCHW", 
        "hash": "63f009be3ca8ba83", 
        "src_layout": "NCHW4c"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_global_avg_pool2d", 
        "out_layout": "", 
        "layout": "NCHW", 
        "hash": "7725c41ab86b808c"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_batch_flatten_nn_batch_flatten", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_batch_flatten_nn_batch_flatten", 
        "hash": "77989e98441d962d"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_nn_contrib_dense_pack_expand_dims_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_nn_contrib_dense_pack_expand_dims_add", 
        "src_layout": "NC", 
        "dst_layout": "NC8n", 
        "hash": "fd019452e0952fcd", 
        "weight_layout": "NC8n"
      }, 
      "inputs": [
        [
          63, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    14, 
    15, 
    17, 
    18, 
    20, 
    21, 
    22, 
    23, 
    26, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41, 
    42, 
    44, 
    45, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    59, 
    60, 
    64, 
    65
  ], 
  "heads": [
    [
      66, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        3, 
        7, 
        8, 
        9, 
        10, 
        11, 
        4, 
        12, 
        13, 
        3, 
        14, 
        15, 
        4, 
        16, 
        17, 
        18, 
        19, 
        9, 
        3, 
        20, 
        21, 
        4, 
        22, 
        23, 
        9, 
        24, 
        25, 
        4, 
        26, 
        27, 
        28, 
        29, 
        3, 
        9, 
        30, 
        31, 
        4, 
        32, 
        33, 
        3, 
        34, 
        35, 
        4, 
        36, 
        37, 
        38, 
        39, 
        9, 
        40, 
        41, 
        42, 
        4, 
        43, 
        44, 
        9, 
        40, 
        4, 
        45, 
        46, 
        9
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 32, 32], 
        [64, 3, 7, 7], 
        [64], 
        [1, 64, 16, 16], 
        [1, 64, 8, 8], 
        [64, 64, 3, 3], 
        [64], 
        [1, 64, 8, 8], 
        [64, 64, 3, 3], 
        [64], 
        [1, 64, 8, 8], 
        [64, 64, 3, 3], 
        [64], 
        [1, 64, 8, 8], 
        [64, 64, 3, 3], 
        [64], 
        [1, 64, 8, 8], 
        [128, 64, 3, 3], 
        [128], 
        [1, 128, 4, 4], 
        [128, 128, 3, 3], 
        [128], 
        [128, 64, 1, 1], 
        [128], 
        [1, 128, 4, 4], 
        [1, 128, 4, 4], 
        [128, 128, 3, 3], 
        [128], 
        [1, 128, 4, 4], 
        [128, 128, 3, 3], 
        [128], 
        [1, 128, 4, 4], 
        [256, 128, 3, 3], 
        [256], 
        [1, 256, 2, 2], 
        [256, 256, 3, 3], 
        [256], 
        [256, 128, 1, 1], 
        [256], 
        [1, 256, 2, 2], 
        [1, 256, 2, 2], 
        [256, 256, 3, 3], 
        [256], 
        [1, 256, 2, 2], 
        [256, 256, 3, 3], 
        [256], 
        [1, 256, 2, 2], 
        [512, 256, 3, 3], 
        [512], 
        [1, 512, 1, 1], 
        [512, 512, 3, 3], 
        [512], 
        [512, 256, 1, 1], 
        [512], 
        [1, 512, 1, 1], 
        [1, 512, 1, 1], 
        [512, 512, 3, 3], 
        [512], 
        [1, 512, 1, 1], 
        [512, 512, 3, 3], 
        [512], 
        [1, 512, 1, 1], 
        [1, 512, 1, 1], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67
  ]
}